Task-1
Titanic Survival Prediction

Importing the necessary libraries

In [173]:
import numpy as np
import pandas as pd

Read the dataset

In [174]:
Titanic_dataset = pd.read_csv('Titanic-Dataset.csv')

In [175]:
Titanic_dataset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Ranges of the individual values

In [176]:
Titanic_dataset.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Change the male female into 1 and 0

In [177]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()

Titanic_dataset['Sex']= labelencoder.fit_transform(Titanic_dataset['Sex'])

check for the null values

In [178]:
from sklearn.model_selection import StratifiedShuffleSplit

split = StratifiedShuffleSplit (n_splits=1, test_size = 0.2)
for train_indices, test_indices in split.split(Titanic_dataset, Titanic_dataset[["Survived", "Pclass", "Sex"]]):
    train_set = Titanic_dataset.loc[train_indices]
    test_set = Titanic_dataset.loc[train_indices]
    train_set.info()

<class 'pandas.core.frame.DataFrame'>
Index: 712 entries, 823 to 847
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  712 non-null    int64
 1   Survived     712 non-null    int64
 2   Pclass       712 non-null    int64
 3   Name         712 non-null    object
 4   Sex          712 non-null    int64
 5   Age          572 non-null    float64
 6   SibSp        712 non-null    int64
 7   Parch        712 non-null    int64
 8   Ticket       712 non-null    object
 9   Fare         712 non-null    float64
 10  Cabin        158 non-null    object
 11  Embarked     710 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 72.3+ KB

fill the null values in the columns by the mean values

In [179]:
Titanic_dataset.fillna({'Age' : Titanic_dataset['Age'].median()}, inplace=True)

Replace NaN values

In [180]:
Titanic_dataset.replace([np.inf, -np.inf], np.nan, inplace=True)
Titanic_dataset.dropna(inplace=True)

Drop the columns which are not neccessary for prediction

In [181]:
Titanic_dataset = Titanic_dataset.drop(['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked'], axis=1)

Split the data into features on x-axis and targets on y-axis

In [182]:
X = Titanic_dataset.drop('Survived',axis=1)
Y = Titanic_dataset['Survived']

Split the data into training and testing sets

In [183]:
from sklearn.model_selection import train_test_split

X_train, X_test, Y_train, Y_test = train_test_split(X,Y,test_size=0.2,random_state=42)

Train a Data Tree Classifier and make predictions

In [184]:
from sklearn.tree import DecisionTreeClassifier

dtc = DecisionTreeClassifier(random_state = 42)
dtc.fit(X_train, Y_train)

train_pred = dtc.predict(X_test)

check the data

In [185]:
print(Y_test.shape)
print(train_pred.shape)

print(Y_test)
print(train_pred)

(41,)
(41,)
438    0
88     1
166    1
710    1
809    1
515    0
319    1
748    0
712    1
245    0
310    1
679    1
730    1
340    1
862    1
887    1
284    0
690    1
356    1
318    1
556    1
92     0
802    1
434    0
309    1
298    1
369    1
311    1
558    1
627    1
52     1
97     1
275    1
336    0
717    1
473    1
609    1
621    1
724    1
337    1
341    1
Name: Survived, dtype: int64
[1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 0 1 1 1
 0 1 1 1]

Evaluate the model

In [186]:
from sklearn.metrics import accuracy_score, classification_report
accuracy = accuracy_score(Y_test, train_pred)
report = classification_report(Y_test, train_pred)

print("accuracy: {:.2f}%".format(accuracy * 100))
print("classification_report:\n", report)

accuracy: 82.93%
classification_report:
               precision    recall  f1-score   support

           0       0.60      0.38      0.46         8
           1       0.86      0.94      0.90        33

    accuracy                           0.83        41
   macro avg       0.73      0.66      0.68        41
weighted avg       0.81      0.83      0.81        41